; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-6-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-2 - location
	p0-3 - location
	p0-4 - location
	p2-3 - location
	p2-5 - location
	p3-0 - location
	p3-1 - location
	p4-1 - location
	p5-0 - location
	p5-1 - location
	p5-4 - location
	p5-6 - location
	p6-2 - location
	p6-4 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s5)
	(at driver3 s1)
	(at driver4 s3)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s5)
	(empty truck3)
	(at truck4 s5)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at truck6 s3)
	(empty truck6)
	(at package1 s6)
	(at package2 s3)
	(at package3 s2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 34)
	(= (time-to-walk p0-2 s0) 34)
	(= (time-to-walk s2 p0-2) 79)
	(= (time-to-walk p0-2 s2) 79)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 77)
	(= (time-to-walk p0-3 s0) 77)
	(= (time-to-walk s3 p0-3) 47)
	(= (time-to-walk p0-3 s3) 47)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(= (time-to-walk s0 p0-4) 44)
	(= (time-to-walk p0-4 s0) 44)
	(= (time-to-walk s4 p0-4) 4)
	(= (time-to-walk p0-4 s4) 4)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 58)
	(= (time-to-walk p2-3 s2) 58)
	(= (time-to-walk s3 p2-3) 66)
	(= (time-to-walk p2-3 s3) 66)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 17)
	(= (time-to-walk p2-5 s2) 17)
	(= (time-to-walk s5 p2-5) 92)
	(= (time-to-walk p2-5 s5) 92)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 41)
	(= (time-to-walk p3-1 s3) 41)
	(= (time-to-walk s1 p3-1) 12)
	(= (time-to-walk p3-1 s1) 12)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 49)
	(= (time-to-walk p4-1 s4) 49)
	(= (time-to-walk s1 p4-1) 25)
	(= (time-to-walk p4-1 s1) 25)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 3)
	(= (time-to-walk p5-0 s5) 3)
	(= (time-to-walk s0 p5-0) 74)
	(= (time-to-walk p5-0 s0) 74)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 29)
	(= (time-to-walk p5-1 s5) 29)
	(= (time-to-walk s1 p5-1) 48)
	(= (time-to-walk p5-1 s1) 48)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 17)
	(= (time-to-walk p5-4 s5) 17)
	(= (time-to-walk s4 p5-4) 76)
	(= (time-to-walk p5-4 s4) 76)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 38)
	(= (time-to-walk p5-6 s5) 38)
	(= (time-to-walk s6 p5-6) 14)
	(= (time-to-walk p5-6 s6) 14)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 66)
	(= (time-to-walk p6-2 s6) 66)
	(= (time-to-walk s2 p6-2) 65)
	(= (time-to-walk p6-2 s2) 65)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(= (time-to-walk s6 p6-4) 53)
	(= (time-to-walk p6-4 s6) 53)
	(= (time-to-walk s4 p6-4) 10)
	(= (time-to-walk p6-4 s4) 10)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 73)
	(= (time-to-drive s1 s0) 73)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 20)
	(= (time-to-drive s2 s0) 20)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 39)
	(= (time-to-drive s3 s0) 39)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 6)
	(= (time-to-drive s1 s2) 6)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 73)
	(= (time-to-drive s4 s2) 73)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 73)
	(= (time-to-drive s1 s3) 73)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 84)
	(= (time-to-drive s5 s3) 84)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 50)
	(= (time-to-drive s6 s3) 50)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 19)
	(= (time-to-drive s1 s4) 19)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 27)
	(= (time-to-drive s1 s5) 27)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 53)
	(= (time-to-drive s0 s6) 53)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 76)
	(= (time-to-drive s1 s6) 76)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 92)
	(= (time-to-drive s2 s6) 92)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 69)
	(= (time-to-drive s5 s6) 69)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s1)
	(at truck2 s0)
	(at truck3 s6)
	(at truck5 s3)
	(at truck6 s6)
	(at package1 s1)
	(at package2 s0)
	(at package3 s2)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 2  (driven))) (* 4  (walked))))

)

; plan
1. (board-truck driver2 truck3 s5)
   deleted: (at driver2 s5) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 2 of 9
2. (board-truck driver4 truck6 s3)
   deleted: (at driver4 s3) (empty truck6)
   added: (driving driver4 truck6)
   goals met: 2 of 9
3. (drive-truck truck3 s5 s6 driver2)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   changed: (driven) from 0 to 69
   goals met: 3 of 9
4. (load-truck package1 truck3 s6)
   deleted: (at package1 s6)
   added: (in package1 truck3)
   goals met: 3 of 9
5. (load-truck package2 truck6 s3)
   deleted: (at package2 s3)
   added: (in package2 truck6)
   goals met: 3 of 9
6. (drive-truck truck6 s3 s6 driver4)
   deleted: (at truck6 s3)
   added: (at truck6 s6)
   changed: (driven) from 69 to 119
   goals met: 4 of 9
7. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 4 of 9
8. (drive-truck truck6 s6 s0 driver4)
   deleted: (at truck6 s6)
   added: (at truck6 s0)
   changed: (driven) from 119 to 172
   goals met: 3 of 9
9. (unload-truck package2 truck6 s0)
   deleted: (in package2 truck6)
   added: (at package2 s0)
   goals met: 4 of 9
10. (drive-truck truck3 s6 s1 driver2)
   deleted: (at truck3 s6)
   added: (at truck3 s1)
   changed: (driven) from 172 to 248
   goals met: 3 of 9
11. (unload-truck package1 truck3 s1)
   deleted: (in package1 truck3)
   added: (at package1 s1)
   goals met: 4 of 9
12. (disembark-truck driver4 truck6 s0)
   deleted: (driving driver4 truck6)
   added: (at driver4 s0) (empty truck6)
   goals met: 4 of 9
13. (board-truck driver4 truck5 s0)
   deleted: (at driver4 s0) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 4 of 9
14. (drive-truck truck5 s0 s3 driver4)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   changed: (driven) from 248 to 287
   goals met: 5 of 9
15. (drive-truck truck3 s1 s0 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (driven) from 287 to 360
   goals met: 5 of 9
16. (disembark-truck driver2 truck3 s0)
   deleted: (driving driver2 truck3)
   added: (at driver2 s0) (empty truck3)
   goals met: 5 of 9
17. (board-truck driver2 truck6 s0)
   deleted: (at driver2 s0) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 5 of 9
18. (drive-truck truck6 s0 s6 driver2)
   deleted: (at truck6 s0)
   added: (at truck6 s6)
   changed: (driven) from 360 to 413
   goals met: 6 of 9
19. (drive-truck truck5 s3 s0 driver4)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   changed: (driven) from 413 to 452
   goals met: 5 of 9
20. (disembark-truck driver4 truck5 s0)
   deleted: (driving driver4 truck5)
   added: (at driver4 s0) (empty truck5)
   goals met: 5 of 9
21. (board-truck driver4 truck3 s0)
   deleted: (at driver4 s0) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 5 of 9
22. (drive-truck truck3 s0 s6 driver4)
   deleted: (at truck3 s0)
   added: (at truck3 s6)
   changed: (driven) from 452 to 505
   goals met: 6 of 9
23. (drive-truck truck6 s6 s0 driver2)
   deleted: (at truck6 s6)
   added: (at truck6 s0)
   changed: (driven) from 505 to 558
   goals met: 5 of 9
24. (disembark-truck driver2 truck6 s0)
   deleted: (driving driver2 truck6)
   added: (at driver2 s0) (empty truck6)
   goals met: 5 of 9
25. (board-truck driver2 truck5 s0)
   deleted: (at driver2 s0) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 5 of 9
26. (drive-truck truck5 s0 s1 driver2)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   changed: (driven) from 558 to 631
   goals met: 5 of 9
27. (disembark-truck driver2 truck5 s1)
   deleted: (driving driver2 truck5)
   added: (at driver2 s1) (empty truck5)
   goals met: 6 of 9
28. (drive-truck truck3 s6 s0 driver4)
   deleted: (at truck3 s6)
   added: (at truck3 s0)
   changed: (driven) from 631 to 684
   goals met: 5 of 9
29. (board-truck driver2 truck5 s1)
   deleted: (at driver2 s1) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 4 of 9
30. (disembark-truck driver4 truck3 s0)
   deleted: (driving driver4 truck3)
   added: (at driver4 s0) (empty truck3)
   goals met: 4 of 9
31. (board-truck driver4 truck6 s0)
   deleted: (at driver4 s0) (empty truck6)
   added: (driving driver4 truck6)
   goals met: 4 of 9
32. (drive-truck truck6 s0 s6 driver4)
   deleted: (at truck6 s0)
   added: (at truck6 s6)
   changed: (driven) from 684 to 737
   goals met: 5 of 9
33. (drive-truck truck5 s1 s0 driver2)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   changed: (driven) from 737 to 810
   goals met: 5 of 9
34. (disembark-truck driver2 truck5 s0)
   deleted: (driving driver2 truck5)
   added: (at driver2 s0) (empty truck5)
   goals met: 5 of 9
35. (drive-truck truck2 s1 s0 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (driven) from 810 to 883
   goals met: 6 of 9
36. (drive-truck truck6 s6 s1 driver4)
   deleted: (at truck6 s6)
   added: (at truck6 s1)
   changed: (driven) from 883 to 959
   goals met: 5 of 9
37. (disembark-truck driver4 truck6 s1)
   deleted: (driving driver4 truck6)
   added: (at driver4 s1) (empty truck6)
   goals met: 5 of 9
38. (disembark-truck driver3 truck2 s0)
   deleted: (driving driver3 truck2)
   added: (at driver3 s0) (empty truck2)
   goals met: 5 of 9
39. (board-truck driver3 truck5 s0)
   deleted: (at driver3 s0) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 5 of 9
40. (drive-truck truck5 s0 s3 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   changed: (driven) from 959 to 998
   goals met: 6 of 9
41. (board-truck driver2 truck2 s0)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 6 of 9
42. (drive-truck truck2 s0 s1 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 998 to 1071
   goals met: 5 of 9
43. (drive-truck truck5 s3 s0 driver3)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   changed: (driven) from 1071 to 1110
   goals met: 4 of 9
44. (disembark-truck driver3 truck5 s0)
   deleted: (driving driver3 truck5)
   added: (at driver3 s0) (empty truck5)
   goals met: 4 of 9
45. (board-truck driver3 truck3 s0)
   deleted: (at driver3 s0) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 4 of 9
46. (drive-truck truck3 s0 s6 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s6)
   changed: (driven) from 1110 to 1163
   goals met: 5 of 9
47. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 6 of 9
48. (board-truck driver2 truck6 s1)
   deleted: (at driver2 s1) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 5 of 9
49. (walk driver1 s2 p0-2)
   deleted: (at driver1 s2)
   added: (at driver1 p0-2)
   changed: (walked) from 0 to 79
   goals met: 4 of 9
50. (board-truck driver4 truck2 s1)
   deleted: (at driver4 s1) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 4 of 9
51. (walk driver1 p0-2 s0)
   deleted: (at driver1 p0-2)
   added: (at driver1 s0)
   changed: (walked) from 79 to 113
   goals met: 4 of 9
52. (board-truck driver1 truck5 s0)
   deleted: (at driver1 s0) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 4 of 9
53. (drive-truck truck5 s0 s3 driver1)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   changed: (driven) from 1163 to 1202
   goals met: 5 of 9
54. (drive-truck truck6 s1 s3 driver2)
   deleted: (at truck6 s1)
   added: (at truck6 s3)
   changed: (driven) from 1202 to 1275
   goals met: 5 of 9
55. (drive-truck truck2 s1 s0 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (driven) from 1275 to 1348
   goals met: 6 of 9
56. (disembark-truck driver2 truck6 s3)
   deleted: (driving driver2 truck6)
   added: (at driver2 s3) (empty truck6)
   goals met: 6 of 9
57. (walk driver2 s3 p3-1)
   deleted: (at driver2 s3)
   added: (at driver2 p3-1)
   changed: (walked) from 113 to 154
   goals met: 6 of 9
58. (drive-truck truck5 s3 s6 driver1)
   deleted: (at truck5 s3)
   added: (at truck5 s6)
   changed: (driven) from 1348 to 1398
   goals met: 5 of 9
59. (walk driver2 p3-1 s1)
   deleted: (at driver2 p3-1)
   added: (at driver2 s1)
   changed: (walked) from 154 to 166
   goals met: 6 of 9
60. (drive-truck truck5 s6 s2 driver1)
   deleted: (at truck5 s6)
   added: (at truck5 s2)
   changed: (driven) from 1398 to 1490
   goals met: 6 of 9
61. (disembark-truck driver1 truck5 s2)
   deleted: (driving driver1 truck5)
   added: (at driver1 s2) (empty truck5)
   goals met: 7 of 9
62. (drive-truck truck3 s6 s3 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s3)
   changed: (driven) from 1490 to 1540
   goals met: 6 of 9
63. (disembark-truck driver3 truck3 s3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s3) (empty truck3)
   goals met: 6 of 9
64. (board-truck driver3 truck6 s3)
   deleted: (at driver3 s3) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 6 of 9
65. (drive-truck truck6 s3 s6 driver3)
   deleted: (at truck6 s3)
   added: (at truck6 s6)
   changed: (driven) from 1540 to 1590
   goals met: 7 of 9
66. (board-truck driver1 truck5 s2)
   deleted: (at driver1 s2) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 6 of 9
67. (drive-truck truck5 s2 s1 driver1)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   changed: (driven) from 1590 to 1596
   goals met: 6 of 9
68. (drive-truck truck5 s1 s3 driver1)
   deleted: (at truck5 s1)
   added: (at truck5 s3)
   changed: (driven) from 1596 to 1669
   goals met: 7 of 9
69. (disembark-truck driver4 truck2 s0)
   deleted: (driving driver4 truck2)
   added: (at driver4 s0) (empty truck2)
   goals met: 7 of 9
70. (drive-truck truck6 s6 s3 driver3)
   deleted: (at truck6 s6)
   added: (at truck6 s3)
   changed: (driven) from 1669 to 1719
   goals met: 6 of 9
71. (drive-truck truck6 s3 s0 driver3)
   deleted: (at truck6 s3)
   added: (at truck6 s0)
   changed: (driven) from 1719 to 1758
   goals met: 6 of 9
72. (disembark-truck driver3 truck6 s0)
   deleted: (driving driver3 truck6)
   added: (at driver3 s0) (empty truck6)
   goals met: 6 of 9
73. (disembark-truck driver1 truck5 s3)
   deleted: (driving driver1 truck5)
   added: (at driver1 s3) (empty truck5)
   goals met: 6 of 9
74. (walk driver1 s3 p2-3)
   deleted: (at driver1 s3)
   added: (at driver1 p2-3)
   changed: (walked) from 166 to 232
   goals met: 6 of 9
75. (walk driver1 p2-3 s2)
   deleted: (at driver1 p2-3)
   added: (at driver1 s2)
   changed: (walked) from 232 to 290
   goals met: 7 of 9
76. (walk driver4 s0 p0-3)
   deleted: (at driver4 s0)
   added: (at driver4 p0-3)
   changed: (walked) from 290 to 367
   goals met: 7 of 9
77. (board-truck driver3 truck6 s0)
   deleted: (at driver3 s0) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 7 of 9
78. (drive-truck truck6 s0 s6 driver3)
   deleted: (at truck6 s0)
   added: (at truck6 s6)
   changed: (driven) from 1758 to 1811
   goals met: 8 of 9
79. (walk driver4 p0-3 s3)
   deleted: (at driver4 p0-3)
   added: (at driver4 s3)
   changed: (walked) from 367 to 414
   goals met: 8 of 9
80. (board-truck driver4 truck3 s3)
   deleted: (at driver4 s3) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 8 of 9
81. (drive-truck truck3 s3 s6 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s6)
   changed: (driven) from 1811 to 1861
   goals met: 9 of 9
